
## Plan Result (prod_dns)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.adguard_gamora.adguard_config.config
  * module.adguard_thanos.adguard_config.config


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.adguard_gamora.adguard_config.config will be created
  + resource "adguard_config" "config" {
      + blocked_services_pause_schedule = {
          + fri = {}
          + mon = {}
          + sat = {}
          + sun = {}
          + thu = {}
          + tue = {}
          + wed = {}
        }
      + dhcp                            = {
          + enabled       = false
          + interface     = ""
          + ipv4_settings = {
              + gateway_ip     = ""
              + lease_duration = 0
              + range_end      = ""
              + range_start    = ""
              + subnet_mask    = ""
            }
          + ipv6_settings = {
              + lease_duration = 86400
              + range_start    = ""
            }
        }
      + dns                             = {
          + blocked_hosts              = [
              + "hostname.bind",
              + "id.server",
              + "version.bind",
            ]
          + blocked_response_ttl       = 10
          + blocking_ipv4              = ""
          + blocking_ipv6              = ""
          + blocking_mode              = "default"
          + bootstrap_dns              = [
              + "1.1.1.1",
              + "1.0.0.1",
            ]
          + cache_optimistic           = false
          + cache_size                 = 4194304
          + cache_ttl_max              = 0
          + cache_ttl_min              = 0
          + disable_ipv6               = false
          + dnssec_enabled             = false
          + edns_cs_custom_ip          = ""
          + edns_cs_enabled            = false
          + edns_cs_use_custom         = false
          + fallback_dns               = [
              + "https://1.1.1.1/dns-query",
              + "https://1.0.0.1/dns-query",
            ]
          + local_ptr_upstreams        = []
          + protection_enabled         = true
          + rate_limit                 = 30
          + rate_limit_subnet_len_ipv4 = 24
          + rate_limit_subnet_len_ipv6 = 56
          + resolve_clients            = true
          + upstream_dns               = [
              + "https://dns10.quad9.net/dns-query",
            ]
          + upstream_mode              = "load_balance"
          + use_private_ptr_resolvers  = false
        }
      + filtering                       = {
          + enabled         = true
          + update_interval = 24
        }
      + id                              = (known after apply)
      + last_updated                    = (known after apply)
      + parental_control                = false
      + querylog                        = {
          + anonymize_client_ip = false
          + enabled             = true
          + ignored             = []
          + interval            = 2160
        }
      + safebrowsing                    = false
      + safesearch                      = {
          + enabled  = false
          + services = [
              + "bing",
              + "duckduckgo",
              + "google",
              + "pixabay",
              + "yandex",
              + "youtube",
            ]
        }
      + stats                           = {
          + enabled  = true
          + ignored  = []
          + interval = 168
        }
      + tls                             = {
          + certificate_chain  = ""
          + dns_names          = (known after apply)
          + enabled            = false
          + force_https        = false
          + issuer             = (known after apply)
          + key_type           = (known after apply)
          + not_after          = (known after apply)
          + not_before         = (known after apply)
          + port_dns_over_quic = 853
          + port_dns_over_tls  = 853
          + port_https         = 443
          + private_key        = ""
          + private_key_saved  = (known after apply)
          + serve_plain_dns    = true
          + server_name        = ""
          + subject            = (known after apply)
          + valid_cert         = (known after apply)
          + valid_chain        = (known after apply)
          + valid_key          = (known after apply)
          + valid_pair         = (known after apply)
          + warning_validation = (known after apply)
        }
    }

  # module.adguard_thanos.adguard_config.config will be created
  + resource "adguard_config" "config" {
      + blocked_services_pause_schedule = {
          + fri = {}
          + mon = {}
          + sat = {}
          + sun = {}
          + thu = {}
          + tue = {}
          + wed = {}
        }
      + dhcp                            = {
          + enabled       = false
          + interface     = ""
          + ipv4_settings = {
              + gateway_ip     = ""
              + lease_duration = 0
              + range_end      = ""
              + range_start    = ""
              + subnet_mask    = ""
            }
          + ipv6_settings = {
              + lease_duration = 86400
              + range_start    = ""
            }
        }
      + dns                             = {
          + blocked_hosts              = [
              + "hostname.bind",
              + "id.server",
              + "version.bind",
            ]
          + blocked_response_ttl       = 10
          + blocking_ipv4              = ""
          + blocking_ipv6              = ""
          + blocking_mode              = "default"
          + bootstrap_dns              = [
              + "1.1.1.1",
              + "1.0.0.1",
            ]
          + cache_optimistic           = false
          + cache_size                 = 4194304
          + cache_ttl_max              = 0
          + cache_ttl_min              = 0
          + disable_ipv6               = false
          + dnssec_enabled             = false
          + edns_cs_custom_ip          = ""
          + edns_cs_enabled            = false
          + edns_cs_use_custom         = false
          + fallback_dns               = [
              + "https://1.1.1.1/dns-query",
              + "https://1.0.0.1/dns-query",
            ]
          + local_ptr_upstreams        = []
          + protection_enabled         = true
          + rate_limit                 = 30
          + rate_limit_subnet_len_ipv4 = 24
          + rate_limit_subnet_len_ipv6 = 56
          + resolve_clients            = true
          + upstream_dns               = [
              + "https://dns10.quad9.net/dns-query",
            ]
          + upstream_mode              = "load_balance"
          + use_private_ptr_resolvers  = false
        }
      + filtering                       = {
          + enabled         = true
          + update_interval = 24
        }
      + id                              = (known after apply)
      + last_updated                    = (known after apply)
      + parental_control                = false
      + querylog                        = {
          + anonymize_client_ip = false
          + enabled             = true
          + ignored             = []
          + interval            = 2160
        }
      + safebrowsing                    = false
      + safesearch                      = {
          + enabled  = false
          + services = [
              + "bing",
              + "duckduckgo",
              + "google",
              + "pixabay",
              + "yandex",
              + "youtube",
            ]
        }
      + stats                           = {
          + enabled  = true
          + ignored  = []
          + interval = 168
        }
      + tls                             = {
          + certificate_chain  = ""
          + dns_names          = (known after apply)
          + enabled            = false
          + force_https        = false
          + issuer             = (known after apply)
          + key_type           = (known after apply)
          + not_after          = (known after apply)
          + not_before         = (known after apply)
          + port_dns_over_quic = 853
          + port_dns_over_tls  = 853
          + port_https         = 443
          + private_key        = ""
          + private_key_saved  = (known after apply)
          + serve_plain_dns    = true
          + server_name        = ""
          + subject            = (known after apply)
          + valid_cert         = (known after apply)
          + valid_chain        = (known after apply)
          + valid_key          = (known after apply)
          + valid_pair         = (known after apply)
          + warning_validation = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":332,"Program":"tfcmt","SHA1":"","Target":"prod_dns","Vars":{}} -->